Aktualizace obsahu prihlasky + ilustracni obrazky, footer, rozbalovace
